# Aufgabe 4

In [ ]:
%CREATE :memory:

CREATE TABLE LEHRE (
    Student   INTEGER,
    Vorlesung VARCHAR,
    Professor VARCHAR,
    PRIMARY KEY (Student, Vorlesung, Professor)
);

INSERT INTO LEHRE VALUES
    (49999, 'AuP', 'Schulz'),
    (51234, 'AuP', 'Schulz'),
    (51234, 'BS', 'Bauer'),
    (56789, 'AuP', 'Vogt');

SELECT * FROM LEHRE

## Teil a

In [ ]:
CREATE TABLE LEHRE1a (
    Student   INTEGER,
    Professor VARCHAR,
    PRIMARY KEY (Student, Professor)
);

INSERT INTO LEHRE1a SELECT DISTINCT Student, Professor FROM LEHRE;

SELECT * FROM LEHRE1a

In [ ]:
CREATE TABLE LEHRE2a (
    Student   INTEGER,
    Vorlesung VARCHAR,
    PRIMARY KEY (Student, Vorlesung)
);

INSERT INTO LEHRE2a SELECT DISTINCT Student, Vorlesung FROM LEHRE;

SELECT * FROM LEHRE2a

In [ ]:
SELECT * FROM LEHRE1a NATURAL JOIN LEHRE2a

## Teil b

In [ ]:
CREATE TABLE LEHRE1b (
    Vorlesung VARCHAR,
    Professor VARCHAR,
    PRIMARY KEY (Professor)
);

INSERT INTO LEHRE1b SELECT DISTINCT Vorlesung, Professor FROM LEHRE;

SELECT * FROM LEHRE1b

In [ ]:
CREATE TABLE LEHRE2b (
    Vorlesung VARCHAR,
    Student   INTEGER,
    PRIMARY KEY (Vorlesung, Student)
);

INSERT INTO LEHRE2b SELECT DISTINCT Vorlesung, Student FROM LEHRE;

SELECT * FROM LEHRE2b

In [ ]:
SELECT * FROM LEHRE1b NATURAL JOIN LEHRE2b

## Teil c

In [ ]:
CREATE TABLE LEHRE1c (
    Professor VARCHAR,
    Vorlesung VARCHAR,
    PRIMARY KEY (Professor)
);

INSERT INTO LEHRE1c SELECT DISTINCT Professor, Vorlesung FROM LEHRE;

SELECT * FROM LEHRE1c

In [ ]:
CREATE TABLE LEHRE2c (
    Professor VARCHAR,
    Student   INTEGER,
    PRIMARY KEY (Professor, Student)
);

INSERT INTO LEHRE2c SELECT DISTINCT Professor, Student FROM LEHRE;

SELECT * FROM LEHRE2c

In [ ]:
SELECT * FROM LEHRE1c NATURAL JOIN LEHRE2c